Revit 2027 API
BumpMap.TextureURepeat Property
 The property labeled "U Repeat" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TextureURepeat { get; }
Public Shared ReadOnly Property TextureURepeat As String
	Get
public:
static property String^ TextureURepeat {
	String^ get ();
}
static member TextureURepeat : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
BumpMap Class
Autodesk.Revit.DB.Visual Namespace